[
  {
    "date": "2026-01-30",
    "game": "Pong-ish",
    "slug": "pongish",
    "category": "input",
    "lesson": "Keep controls minimal and responsive: Arrow/WASD + one action is enough for Atari-scale fun."
  },
  {
    "date": "2026-01-30",
    "game": "Pong-ish",
    "slug": "pongish",
    "category": "design",
    "lesson": "Add tiny juice (screen shake, bleep) but keep the loop readable—clarity > effects."
  },
  {
    "date": "2026-01-31",
    "game": "Breakout-ish",
    "slug": "breakoutish",
    "category": "workflow",
    "lesson": "Ship a playable loop first; add polish only after the loop feels good."
  },
  {
    "date": "2026-01-31",
    "game": "Breakout-ish",
    "slug": "breakoutish",
    "category": "design",
    "lesson": "Retro readability matters: high contrast, chunky pixels, and clear feedback."
  },
  {
    "date": "2026-02-08",
    "game": "Asteroids-ish",
    "slug": "asteroidsish",
    "category": "input",
    "lesson": "Rotation-based movement needs different mobile UX than paddle games — joystick axis mapping (X=rotate, Y=thrust) is workable but not as tight as keyboard."
  },
  {
    "date": "2026-02-08",
    "game": "Asteroids-ish",
    "slug": "asteroidsish",
    "category": "design",
    "lesson": "Screen-wrap physics needs safe-zone spawning logic to avoid unfair deaths on wave transitions."
  },
  {
    "date": "2026-02-09",
    "game": "2048 2600",
    "slug": "2048-2600",
    "category": "input",
    "lesson": "For discrete-direction games, swipe detection beats virtual buttons or joysticks — match the input method to the game's movement model."
  },
  {
    "date": "2026-02-09",
    "game": "2048 2600",
    "slug": "2048-2600",
    "category": "design",
    "lesson": "Puzzle games need animation bookkeeping (slide sources, merge targets, new spawns) even though the logic is simple — the feel lives in the transitions."
  },
  {
    "date": "2026-02-09",
    "game": "2048 2600",
    "slug": "2048-2600",
    "category": "workflow",
    "lesson": "Rendering HUD info on canvas instead of DOM keeps embed mode clean and avoids duplicate UI state management."
  },
  {
    "date": "2026-02-10",
    "game": "3-D Tic-Tac-Toe",
    "slug": "3-d-tic-tac-toe",
    "category": "design",
    "lesson": "When representing 3D grids in 2D, showing all layers simultaneously beats layer-switching UX — players need full board visibility for strategic games."
  },
  {
    "date": "2026-02-10",
    "game": "3-D Tic-Tac-Toe",
    "slug": "3-d-tic-tac-toe",
    "category": "ai",
    "lesson": "For board game AI, check immediate wins/blocks before running minimax — it's both faster and ensures the AI never misses an obvious move at any search depth."
  },
  {
    "date": "2026-02-10",
    "game": "3-D Tic-Tac-Toe",
    "slug": "3-d-tic-tac-toe",
    "category": "input",
    "lesson": "64 tap targets on mobile is viable if cells fill available space and ghost previews confirm selection — don't hide information behind navigation when spatial awareness matters."
  },
  {
    "date": "2026-02-11",
    "game": "A-VCS-tec Challenge",
    "slug": "a-vcs-tec-challenge",
    "category": "design",
    "lesson": "Multi-level games benefit from distinct control schemes per level — jump/duck for side-scrolling vs lane-switching for vertical climbing keeps the same inputs feeling fresh."
  },
  {
    "date": "2026-02-11",
    "game": "A-VCS-tec Challenge",
    "slug": "a-vcs-tec-challenge",
    "category": "design",
    "lesson": "Progress bars in endless-feeling runner levels transform anxiety into motivation — players push harder when they can see the finish line approaching."
  },
  {
    "date": "2026-02-12",
    "game": "Aardvark",
    "slug": "aardvark",
    "category": "design",
    "lesson": "Grid-based movement with player-driven terrain modification (digging) adds emergent strategy to simple games — players create their own level layout through play."
  },
  {
    "date": "2026-02-12",
    "game": "Aardvark",
    "slug": "aardvark",
    "category": "mechanics",
    "lesson": "Auto-attacking tongue that extends through tunnel cells creates a natural risk/reward loop — longer reach means catching more ants but also more exposure to fire ants."
  },
  {
    "date": "2026-02-14",
    "game": "Acid Drop",
    "slug": "acid-drop",
    "category": "design",
    "lesson": "Horizontal-only movement games map perfectly to two-button mobile controls — when the game fits, simpler inputs beat joysticks every time."
  },
  {
    "date": "2026-02-14",
    "game": "Acid Drop",
    "slug": "acid-drop",
    "category": "design",
    "lesson": "Visual fill-level feedback (beaker filling up) turns abstract progress into satisfying physical metaphor — players intuitively understand how close they are to level completion."
  }
]